yutaka-ishikawa/portable-tls-ra/test/tlsra_server.c
/*
 * Testing Portable TLS-RA
 *	2026/Jan/3
 */
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <unistd.h>
#include <netdb.h>
#include <sys/socket.h>
#include <netinet/in.h>
#include <openssl/ssl.h>
#include <openssl/err.h>
#include <openssl/provider.h>

#include <ptlsra.h>
#include "tlsra_test.h"

unsigned char	buf[BUF_SIZE];
unsigned char	buf2[BUF_SIZE];
int	dflag = 0;
int	rflag = 0;	/* remote attestation */
int	tflag = 0;
int	vflag = 0;
int	Vflag = 0;	/* verify */
int	Cflag = 0;	/* require Client Certificate */

/*
 * Client certificate verification
 */
static int
verify(int ok, X509_STORE_CTX *ctx)
{
    X509	*x509 = X509_STORE_CTX_get_current_cert(ctx);

    if (x509 == NULL) {
	fprintf(stderr, "%s: Client Cert verificaion fails.\n", __func__);
	return ok;
    }
    printf("Subject: "); TLSRA_show_subject_name(x509);
    printf("Issuer: "); TLSRA_show_issuer_name(x509);
    fprintf(stderr, "%s: Client Cert verificaion ok = %d\n", __func__, ok);
    return ok;
}


static int
sslread(SSL *ssl, unsigned char *bp, int rsz, int count)
{
    int sz, i;
    int	err = 0;
    for (i = 0; i < count; i++) {
	VERBOSE {
	    printf("%s: calling SSL_READ (%p)\n", __func__,  bp);
	}
	sz = SSL_read(ssl, bp, rsz);
	if (sz != rsz) {
	    err++;
	    fprintf(stderr, "received size(%d) expected size(%d)\n", sz, rsz);
	    ERR_print_errors_fp(stderr);
	}
	VERYFY {
	    combuf_vryfy(bp, sz);
	}
    }
    return err;
}

static int
tcpread(int sock, unsigned char *bp, int rsz, int cnt)
{
    int sz, i;
    int	err = 0;
    for (i = 0; i < cnt; i++) {
	sz = read(sock, bp, rsz);
	if (sz != rsz) {
	    err++;
	    fprintf(stderr, "received size(%d) expected size(%d)\n", sz, rsz);
	}
	VERBOSE {
	    combuf_vryfy(bp, sz);
	}
    }
    return err;
}


int
main(int argc, char **argv)
{
    int		sock, csock;
    SSL_CTX	*ctx;
    SSL		*ssl;
    uint16_t	port = DEFAULT_TCP_PORT;
    int		count = DEFAULT_COUNT;
    int		size = DEFAULT_SIZE;
    int		rc;
    int		error = 0;
    char	*env = getenv("SSL_PROVIDER");

    while ((rc = getopt(argc, argv, "Cc:dp:rt:vV")) != -1) {
	switch (rc) {
	case 'C': Cflag = 1; break;
	case 'c':
	    count = atol(optarg); break;
	case 'd':
	    dflag = 1; break;
	case 'p':
	    port = atol(optarg); break;
	case 'r':
	    rflag = 1; break;
	case 't':
	    tflag = atol(optarg); printf("tflag is set\n"); break;
	case 'v':
	    vflag = 1; printf("vflag is set\n"); break;
	case 'V': /* verify */
	    Vflag = 1; printf("Vflag is set\n"); break;
	}
    }
    memset(buf, 0, BUF_SIZE);
    /* SSL initialization */
    if (env) {
	OSSL_PROVIDER	*prov = OSSL_PROVIDER_load(NULL, env);
	printf((prov == NULL ? "Cannot load %s\n" : "Loaded %s\n"), env);
    }
    printf("default-cipher-list: %s\n", OSSL_default_cipher_list());
    printf("default-ciphersuites: %s\n", OSSL_default_ciphersuites());
    SSL_load_error_strings();
    SSL_library_init();
    TLSRA_CALL0(err3, ctx, SSL_CTX_new(SSLv23_server_method()));

    /*
     * TLS RA initialization
     */
    TLSRA_server_init(ctx, rflag);

    /*
     * Client Certificate
     *		Client CA file:
     *		  $ cat caA.pem caB.pem caC.pem > truststore.pem
     *		  calist = SSL_load_client_CA_file("truststore.pem");
     */
    if (Cflag) {
	STACK_OF(X509_NAME) *calist;
	printf("Request Client Certificate !!!\n");
	TLSRA_CALL0(err4, calist, SSL_load_client_CA_file("CA/my_ca.crt"));
	SSL_CTX_set_client_CA_list(ctx, calist);	
	SSL_CTX_set_verify(ctx, SSL_VERIFY_PEER|SSL_VERIFY_FAIL_IF_NO_PEER_CERT, verify);
	SSL_CTX_set_verify_depth(ctx, 10);

    }
    /*
     * SSL is now created from SSL_CTX.
     */
    TLSRA_CALL0(err3, ssl, SSL_new(ctx));
    {
	int priority = 0;
	const char *lst = SSL_get_cipher_list(ssl, priority);
	const char *ver = SSL_get_version(ssl);

	printf("cipher_list: %s\n", lst == NULL ? "No cipers" : lst);
	printf("Server Version: %s\n", ver);
    }

    /* socket listen */
    printf("port = %d\n", port);
    sock = sock_serveropen(INADDR_ANY, port);
    if (sock < 0) {
	fprintf(stderr, "???? \n");
	return -1;
    }
    printf("sock %d\n", sock);

    /* socket accept */
    csock = sock_accept(sock);
    printf("accepted %d\n", csock);
    TLSRA_CALL1(err, rc, SSL_set_fd(ssl, csock));
    printf("Going to accept\n");
    TLSRA_CALL1(err, rc, SSL_accept(ssl));

    printf("Conntected\n");
    printf("Server Version: %s\n", SSL_get_version(ssl));
    /* showing nonces of both client and server */
    TLSRA_show_nonce(ssl);
    {
	X509	*cert = SSL_get_peer_certificate(ssl);
	printf("cert = %p\n", cert);
    }
    switch (tflag) {
    case 0:
	printf("SSL TEST\n");
	error = sslread(ssl, buf, size, count);
	break;
    case 1:
	printf("TCP TEST\n");
	error = tcpread(csock, buf, size, count);
	break;
    }
    if (error == 0) {
	printf("Success:\n");
    }
    goto skip;
    /* finalizing */
err:
    printf("ERROR!!\n");
skip:
    myssl_shutdown(ctx, ssl);
    /* closing comm socket */
    SYS_CALL0(err2, rc, "close", close(csock));
err2:
    /* closing socket */
    SYS_CALL0(err3, rc, "close", close(sock));
    return 0;
err3:
    printf("SSL_CTX_new() fails\n");
    return -1;
err4:
    printf("Cannot load client CA\n");
}
